greet = '''Привет!

Я - бот, который поможет тебе перестать деградировать и начать ботать. Делать это я буду следующим образом:
Каждое утро я буду спрашивать у тебя твои планы на день, а каждый вечер ты будешь мне отчитываться.
Кроме того, о твоих планах и их выполнении узнают несколько других участников эксперимента.
Напиши /participate чтобы принять участие'''

registered = '''Я тебя запомнил. Теперь ты точно сможешь начать ботать:)'''

menu = '''Доступные команды:
/promise - пообещать что-нибудь
/complete - отчитаться о выполнении
/stats - статистика'''

promise_listen = '''Итак, пора строить планы. Что ты обещаешь сделать за сегодня?'''

promise_accept = '''Хорошо, запомнил и буду напоминать.'''

promise_decline = '''Ты уже пообещал мне сделать кое-что другое:

**{}**'''

no_promise = '''Ты ещё не давал(а) обещания сегодня. Ты можешь сделать это с помощью команды /promise'''

status_listen = '''Как твои дела? Ты выполнил своё обещание на сегодня?

**{}**'''

status_success = '''Я рад, что ты смог выполнить то, что запланировал на сегодня! Так держать!'''

status_fail = '''Я вижу, что ты не смог выполнить то, что запланировал на сегодня. Постарайся завтра всё-таки сделать 
это! '''

status_decline = '''План на сегодня уже выполнен или провален. Невозможно выполнить операцию.'''

status_unknown = '''Непонятно. Отключи автозамену и попробуй ещё раз :)'''
